assigns/interp2/interp2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-03 Fri 09:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mini-Project 2: Match Expressions and Error Messages</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../style.css" />
</head>
<body>
<div id="org-div-home-and-up">[<a href="../../index.html">back</a>]</div><div id="content" class="content">
<h1 class="title">Mini-Project 2: Match Expressions and Error Messages</h1>
<p>
For our second mini-project, you'll be building (you guessed it) an
interpreter.  The mini-project is due <b>Thursday 4/16 by 8PM</b>.  <i>It
cannot be dropped.</i> This is the landing-page for the project, it
doesn't contain the actual spec of the project.
</p>
<div id="outline-container-org92ac657" class="outline-2">
<h2 id="org92ac657">One-Week Check-in</h2>
<div class="outline-text-2" id="text-org92ac657">
<p>
To verify you're making progress, you're required to submit part of
the mini-project by <b>Thursday 4/9 by 8PM</b>.  For this check-in (for 30%
of the total grade) you need to complete:
</p>

<ul class="org-ul">
<li>the function <code>type_of_expr</code> for <i>well-typed</i> expressions whose rules
are given in the <b>Rules from Mini-Project 1</b> section. You don't have
to worry about type errors for this check-in.  This means that all
our test cases will expect <code>Ok ty</code> as the output for some type <code>ty</code>.
You can use <code>assert false</code> to fill in all other cases.</li>
<li>the function <code>eval_expr</code> for all expressions whose rules are given
in the <b>Rules from Mini-Project 1</b> section.  You can use <code>assert
  false</code> to fill in all other cases.</li>
</ul>

<p>
This essentially means you need to complete the fragment of this
mini-project that is a repeat of the first mini-project.
</p>

<p>
Good luck, happy coding
</p>
</div>
</div>
</div>
</body>
</html>
